export const CURRICULUM_DATA = {
  "curriculum_info": {
    "country": "Algeria",
    "subject": "Physical Education and Sports",
    "stage": "Primary Education",
    "structure_logic": " Grade > Overall Competence > Field > Final Competence > Criteria > Indicators"
  },
  "curriculum_data": [
    {
      "grade": 1,
      "grade_name": "السنة الأولى ابتدائي",
      "overall_competence": "يقوم بحركات باتخاذ وضعيات وهيئات طبيعية بالتكامل بين مختلف الحركات القاعدية، مستغلاً فضاء الممارسة ومعالمه.",
      "fields": [
        {
          "field_name": "الوضعيّات والتنقلات",
          "final_competence": "يتخذ وضعيات وهيئات طبيعية لها علاقة مع محيطه المباشر.",
          "Competency_compound": [
            "يتعرف على مختلف الوضعيات الطبيعية المألوفة و غير المألوفة في محيطه المباشر",
            "يوظف تكامل أطرافه و يستثمرها في الوضعيات المألوفة و غير المألوفة حسب الموقف",
            "يحترم القواعد العامة عند أخذ مختلف الوضعيات"
          ],
          "Knowledge_resources": {
            "وضعيات_الوقوف": ["الوقوف العادي", "الوقوف ضماً", "الوقوف فتحاً جانبياً", "الوقوف أماماً", "الوقوف خلفاً"],
            "وضعيات_الجلوس": ["الجلوس العادي (التربع)", "الجلوس على شيء", "الجلوس ضماً", "القرفصاء"],
            "وضعيات_الاستلقاء": ["الاستلقاء على الظهر", "الاستلقاء على البطن", "الاستلقاء على الجنب"],
            "وضعيات_غير_مألوفة": ["الانبطاح", "الانتصاب العادي على اربعة", "الانتصاب المعكوس على اربعة", "الوقوف على رجل واحدة", "الوقوف على ركبتين"],
            "التنقل_العادي": ["مشي عادي فردي", "مشي عادي ثنائي", "مشي نشيط فردي", "مشي نشيط ثنائي", "هرولة فردية", "هرولة ثنائية"]
          }
        },
        {
          "field_name": "الحركات القاعدية",
          "final_competence": "ينفذ حركات قاعدية مبنية على تكامل وظائف جسمه.",
          "Competency_compound": [
            "يتعرف على مختلف الحركات القاعدية و التحولات",
            "يوظف مختلف الحركات القاعدية عند التحول",
            "يحترم وتائر الحركات و مسارات التحول"
          ],
          "Knowledge_resources": {
            "شكل_التنقل": ["المشي الفردي", "المشي الثنائي", "الجري الفردي", "الجري الثنائي", "المشي الجانبي", "المشي خلفا"],
            "وتيرة_التنقل": ["المشي البطيء", "المشي المتوسط", "المشي السريع", "الجري البطيء", "الجري المتوسط", "الجري السريع"],
            "التحول_في_شكل_التنقل": ["التحول من المشي للجري تدريجيا", "التحول من الجري للمشي تدريجيا"]
          }
        },
        {
          "field_name": "الهيكلة والبناء",
          "final_competence": "يستغل فضاء الممارسة ومعالمه للتشكل والتنقل المنتظم.",
          "Competency_compound": [
            "يتعرف على فضاءات الممارسة و ضوابطها و مختلف التشكيلات و التقلات المنتظمة",
            "يوظف فضاءات الممارسة وفق معالمها و قواعدها",
            "يحافظ على فضاءات الممارسة"
          ],
          "Knowledge_resources": {
            "فضاءات_الممارسة": ["الفناء", "الساحة", "الملعب", "الرواق"],
            "ضبط_فضاء_الممارسة": ["حدود ميدان الممارسة", "التنقل في فضاء محدد", "مشاركة الفضاء"],
            "التشكيلات_التنقلات": ["الأعداد", "الصفوف", "الأقران"]
          }
        }
      ]
    },
    {
      "grade": 2,
      "grade_name": "السنة الثانية ابتدائي",
      "overall_competence": "ينفذ حركات طبيعية بسيطة في وضعيات وتنقلات متنوعة، ويعدلها حسب الموقف، محدداً الأسلوب المناسب للفضاء المتاح.",
      "fields": [
        {
          "field_name": "الوضعيّات والتنقلات",
          "final_competence": "يعدّل في الوقت المناسب وضعياته وتنقلاته من موقف إلى آخر.",
          "Competency_compound": [
            "يتعرف على الوضعيات و التنقلات و المواقف و مختلف التنظيمات",
            "ينفذ الموقف بما يتماشى و امكانياته الفردية في مختلف الوضعيات",
            "يسهر على سلامة و امن زملائه"
          ],
          "Knowledge_resources": {
            "الوضعية_المناسبة": ["الوقوف", "الانحناء", "الجثو", "المشي", "الجري", "الوثب"],
            "التنقل_المناسب": ["عمل الأطراف", "التسارع", "خفض السرعة", "التنقل على مسار مستقيم", "التنقل على مسار متعرج", "التنقل على دائرة مغلقة"],
            "مواقف_التنفيذ": ["المشي السريع", "الهرولة", "الجري", "الجري السريع"],
            "التنظيم": ["الابتعاد", "الاقتراب", "الازدحام"]
          }
        },
        {
          "field_name": "الحركات القاعدية",
          "final_competence": "ينفذ حركات طبيعية بسيطة في وضعيات متنوعة.",
          "Competency_compound": [
            "يتعرف على الحركات القاعديةالملائمة و تكامل عمل الاطراف في مختلف الوضعيات",
            "يؤدي الحركات القاعدية الملائمة في مختلف الوضعيات",
            "يسهر على حسن أداء مختلف الحركات"
          ],
          "Knowledge_resources": {
            "الحركات_القاعدية_في_وضعيات_مختلفة": ["حركات من وضعية الوقوف", "حركات من وضعية الجثو", "حركات من وضعية الجلوس", "حركات من وضعية التمدد"],
            "تكامل_عمل_الاطراف": ["تكامل عمل الاطراف في المشي", "تكامل عمل الاطراف في الجري", "تكامل عمل الاطراف اثناء الحركة"],
            "الحركات_الملائمة": ["خطوات متناسقة", "خطوات مرتفعة", "المحافظة على السرعة"]
          }
        },
        {
          "field_name": "الهيكلة والبناء",
          "final_competence": "يحدد الأسلوب والفضاء المناسبين لاستعمال أداة.",
          "Competency_compound": [
            "يتعرف على الوسائل و كيفيات توظيفها و حفظها و مجالات استعمالها",
            "يستخدم مختلف الوسائل بالكيفيات المناسبة و يحفظها",
            "يصون الوسائل و يحفظها"
          ],
          "Knowledge_resources": {
            "الوسائل": ["الكرات", "الشواهد", "الأقماع", "الجلة"],
            "الرمي": ["رمي قريب/بعيد", "رمي جانبي/أمامي/خلفي", "الدحرجة"],
            "حفظ_الأدوات": ["الترتيب", "التنظيف", "التخزين"],
            "أسلوب_التنفيذ": ["التسليم والاستلام", "حفظ وترتيب الأدوات"]
          }
        }
      ]
    },
    {
      "grade": 3,
      "grade_name": "السنة الثالثة ابتدائي",
      "overall_competence": "يبني جملة من التصرفات القاعدية المتعلقة بالجري والرمي وينفذها حسب الموقف.",
      "fields": [
        {
          "field_name": "الوضعيّات والتنقلات",
          "final_competence": "يركّب جملة من العمليات وينفذها وفق ما يتطلبه الموقف.",
          "Competency_compound": [
            "يتعرف على كيفية الربط بين تدرج جملة من الحركات ",
            "يلتزم بالتعليمات و التوجيهات المناسبة عند الرمي و الجري",
            "يحترم التعليمات و التوجيهات المقدمة"
          ],
          "Knowledge_resources": {
            "التحول": ["من المشي للهرولة", "من الهرولة للجري ", "من الجري الخفيف للجري السريع"],
            "الرمي": ["الرمي من الثبات بيد واحدة", "الرمي باليدين"],
            "التعليمات_التوجيهات": ["أمن وسلامة الفوج", "احترام مجال الرمي"]
          }
        },
        {
          "field_name": "الحركات القاعدية",
          "final_competence": "ينجز حركات قاعدية متعلقة بالجري وبالرمي.",
          "Competency_compound": [
            "يتعرف على الحركات القاعدية حسب وتائرها و القواعد الأمنية ",
            "ينفذ الحركات القاعديةو يلتزم بالقواعد الأمنية",
            "يحترم القواعدالأمنية"
          ],
          "Knowledge_resources": {
            "الجري": ["الجري على خط مستقيم", "الجري في منعرج", "الجري المتعرج بحمل أداة"],
            "الرمي": ["الرمي لعدة اتجاهات", "الرمي لأبعد مسافة", "الرمي فوق علو معين", "الرمي بيد واحدة", "الرمي باليدين معا"],
            "وتائر_الحركات": ["وتيرة بطيئة", "وتيرة متوسطة", "وتيرة سريعة"]
          }
        },
        {
          "field_name": "الهيكلة والبناء",
          "final_competence": "يبني تصرفاته القاعدية لتنظيم تدخلاته حسب الموقف.",
          "Competency_compound": [
            "يتعرف على التصرفات القاعدية، وطرق التنقل بين المعالم، وعلى الرمي وقواعد المنافسة المناسبة",
            "ينتقل بين المعالم وفق قواعد المنافسة المناسبة",
            "يلتزم بقواعد المنافسة"
          ],
          "Knowledge_resources": {
            "التصرفات_القاعدية": ["التصرّف المناسب للموقف", "زيادة في السرعة واللحاق", "تغيير الاتجاه", "الافلات للتخلص من المنافس"],
            "التنقل_بين_المعالم": ["اجتياز موانع بوسيلة", "رمي أداة في حدود فضاء معيّن", "رمي أداة لمكان معيّن", "رمي أداة على بعد معيّن", "رمي أداة الى علوّ معين"],
            "الالتزام_بقواعد_المنافسة": ["من وسلامة الأخرين"]
          }
        }
      ]
    },
    {
      "grade": 4,
      "grade_name": "السنة الرابعة ابتدائي",
      "overall_competence": "ينجز فردياً وجماعياً حركات قاعدية تتعلق بالوثب والرمي مبنية على وضعيات، محافظاً على ترابطها بما يتماشى وفضاء الممارسة.",
      "fields": [
        {
          "field_name": "الوضعيّات والتنقلات",
          "final_competence": "ينجز مختلف الحركات فردياً وجماعياً ويحافظ على ترابطها.",
          "Competency_compound": [
            "يتعرف على وضعيات الجسم وعمل الأطراف ووتيرة الجري ضمن مجموعة ",
            "يضبط جسمه وعمل أطرافه وفق مختلف وضعيات التنقل",
            "يتعايش مع المحموعة"
          ],
          "Knowledge_resources": {
            "أشكال_التنقلات": ["وضعية الجسم أثناء الجري", "تربية الخطوة وآليتها"],
            "الأطراف_خلال_الجري_بسرعة_قصوى": ["الجري على محور", "الجري على منحنى", "الجري المتعرج"],
            "الجري_ضمن__مجموعة": ["ضبط وتيرة الجري الجماعي"]
          }
        },
        {
          "field_name": "الحركات القاعدية",
          "final_competence": "يؤدي حركات قاعدية متعلقة بالوثب والرمي ويحافظ على تنسيق مراحلها.",
          "Competency_compound": [
            "يتعرّف على أنماط الوثب والرمي وعلى الحركات القاعدية وضوابطها، وعلى فضاء الممارسة المتاح",
            "يمارس أنماط الوثب والرمي والحركات القاعدية للجمباز",
            "يلتزم بأخلاقيات الممارسة"
          ],
          "Knowledge_resources": {
            "أنماط_الوثب_و_أنواعه": ["وثب برجل واحدة", "وثب بالرجلين", "الوثب للأمام", "الوثب للأعلى", "الوثب فتحاً", "الوثب ضماً"],
            "الوثبات_المتتالية": ["الوثبات المتتالية برجل واحدة", "الوثبات المتتالية بتبادل الرجلين"],
            "الرمي_حسب_الموقف": ["الرمي بيد واحدة", "الرمي باليدين", "الرمي من حركة", "الرمي من الثبات", "الرمي للخلف", "الرمي للجانب", "ربط الوثب بالرمي", "أخذ مسافة الاقتراب"],
            "الحركات_القاعدية_للجمباز": ["القفز للأعلى النقزان", "الوثب فتحاً", "الوثب ضماً للصدر"],
            "حركات_التوازن": ["توازن النجمة", "التوازن على رجل واحدة", "التوازن الجانبي"],
            "حركات_الدوران": ["نصف دورةعادية", "دورة كاملة عادي"],
            "حركات_التدحرج": ["التدحرج الأمامي ", "التدحرج الجانبي"]
          }
        },
        {
          "field_name": "الهيكلة والبناء",
          "final_competence": "يبني الحركات القاعدية التي تضمن مواجهة الموقف بما يتماشى وفضاء الممارسة.",
          "Competency_compound": [
            "يجند معارفه وقدرات جسمه للتنقل والرمي والوثب بما يتناسب وفضاء الممارسة",
            "يستغل الفضاء المتاح للتنقل والرمي والوثب",
            "يحترم ضوابط الممارسة في الفضاء المتاح"
          ],
          "Knowledge_resources": {
            "علاقة_التنقل_بالفضاء_المتاح": ["آمن", "خطير", " انتشارالزملاءو المنافسين"],
            "الرمي_بضبط_فضاء_الممارسة": ["المسافات", "الأبعاد", "المجالات"],
            "الوثب_بضبط_فضاء_الممارسة": ["مسار الوثبة", "هيأه الجسم خلال الوثب", " الوثب برجل واحدة لأبعد مسافة", "الوثبات التبادلية"]
          }
        }
      ]
    },
    {
      "grade": 5,
      "grade_name": "السنة الخامسة ابتدائي",
      "overall_competence": "ينجز عمليات فردياً وجماعياً مبنية على حركات قاعدية، ويحافظ على ترابطها، ويلائم وضعية جسمه بما يتوافق والوضعية المطروحة، ويمارس بعض الرياضات الجماعية.",
      "fields": [
        {
          "field_name": "الوضعيّات والتنقلات",
          "final_competence": "ينجز مختلف الوضعيات والتنقلات في الرياضات الفردية والألعاب الجماعية.",
          "Competency_compound": [
            "يتعرّف على الوضعيات الملائمة للجسم في وضعيات الجري والوثب للرمي وكيفيات تعديلها",
            "يلائم وضعيات جسمه حسب مختلف المواقف",
            "يتقيّد بمختلف الوضعيات المناسبة حسب الموقف"
          ],
          "Knowledge_resources": {
            "الوضعيات_الملائمة_للجسم_أثناء_الجري": ["التنسيق بين الأطراف", "التوازن", "الانسيابية", "دنامكية الخطوات مناسبة لوتيرة الجري", "سعة الخطوات مناسبة لوتيرة الجري"],
            "الوضعيات_الملائمة_للجسم_أثناء_الوثب": ["التوازن", "السقوط السليم"],
            "الوضعيات_الملائمة_للجسم_أثناء_الرمي": ["الاحساس بالأداة", "ترتيب القوى عند الدفع", "تحديد مجال الرمي"],
            "الوضعيات_الملائمة_للجسم_أثناء_الاسترخاء": ["الاسترخاء في الجري", "الاسترخاء في الرمي", "الاسترخاء في الوثب"],
            "تسلسل_الدفع": ["تسلسل الدفع في الجري", "تسلسل الدفع في الرمي", "تسلسل الدفع في الوثب"],
            "الانتقال_المناسب": ["الانتقال المناسب لأسلوب الوثب", "الانتقال المناسب لأسلوب الرمي"]
          }
        },
        {
          "field_name": "الحركات القاعدية",
          "final_competence": "ينجز حركات قاعدية مرتبطة بالجري وبالوثب وللرمي بطريقة سليمة.",
          "Competency_compound": [
            "يتعرف على الحركات القاعدية المرتبطة بالجري للوثب للرمي حسب نوعية الأداة المستعملة",
            "يختار الدينامية المناسبة حسب الوضعيّة والموقف",
            "يتقيّد بالتقنيات الملائمة للوضعية وللموقف"
          ],
          "Knowledge_resources": {
            "دينامية_الجري_لمسافات_قصيرة": ["تواتر الخطوات", "تنسيق عمل الأطراف", "اعتدال الجسم خلال الجري"],
            "الوثب": ["أسلوب الوثب و الاجتياز", " استثمارالجري في الوثب ", "الدفع المناسب لنوع الوثب", "تنسيق مراحل الوثب"],
            "الرمي": ["مراحل الرمي", " اسلوب الرمي من مختلف الوضعيات", "استثمارالجري في الرمي", "الرمي لأبعد مسافة بيد واحدة", "الرمي لأبعد مسافة باليدين"],
            "حركات_قاعدية_للجمباز": ["وثبة الغزالة", "وثبات الحجلة"],
            "حركات_التوازن": ["التوازن على الكتفين شمعة", "توازن أمامي على رجل واحدة نجمة"],
            "حركات_الدوران": ["ربع دورة", "نصف دورة", "دورة كاملة على رجل واحدة"],
            "حركات_التدحرج": ["تدحرج خلفي فتحاً", "تدحرج خلفي عادي", "تدحرج امامي فتحاً"]
          }
        },
        {
          "field_name": "الهيكلة والبناء",
          "final_competence": "يمارس بعض الرياضات الجماعية وفق مبادئ اللعبة والتقنيات الأساسية.",
          "Competency_compound": [
            "يجند معارفه الأساسية المتعلقة ببعض الألعاب الجماعية، ويتعرف على قواعدها",
            "يوظف المفاهيم الأساسية للألعاب الجماعية ومبادئها الأولية",
            "يحترم قواعد اللعب الجماعي الأساسية ومبادئه"
          ],
          "Knowledge_resources": {
            "الألعاب_الجماعية": ["كرة اليد للصغار", "كرة السلة للصغار"],
            "المبادئ_التكتيكية_الأولية": ["الملعب و أطواله", "قواعد اللعبة", "التوزيع المنظم في الملعب", "اللعب الجماعي", "مبادئ الدفاع والهجوم"],
            "الحركات_التقنية_أساسية": ["تمريرات الكرة و مسكها", "المراوغة والتنقل بالكرة", "القذف"]
          }
        }
      ]
    }
  ]
};
