export const ALGERIAN_CURRICULUM = {
  "Curriculum_subject": {
    "Annual_Programs": {
      "السنة_الأولى": {
        "Overall_efficiency": "يقوم بحركات باتخاذ وضعيات وهيئات طبيعية بالتكامل بين مختلف الحركات القاعدية، مستغلاً فضاء الممارسة ومعالمه.",
        "Learning_Field": [
          {
            "Field_Title": "الوضعيّات والتنقلات",
            "Final_Competency": "يتخذ وضعيات وهيئات طبيعية لها علاقة مع محيطه المباشر.",
            "Competency_compound": [
              "يتعرف على مختلف الوضعيات الطبيعية المألوفة و غير المألوفة في محيطه المباشر",
              "يوظف تكامل أطرافه و يستثمرها في الوضعيات المألوفة و غير المألوفة حسب الموقف",
              "يحترم القواعد العامة عند أخذ مختلف الوضعيات"
            ],
            "Knowledge_resources": {
              "وضعيات_الوقوف": ["الوقوف العادي", "الوقوف ضماً", "الوقوف فتحاً جانبياً", "الوقوف أماماً", "الوقوف خلفاً"],
              "وضعيات_الجلوس": ["الجلوس العادي (التربع)", "الجلوس على شيء", "الجلوس ضماً", "القرفصاء"],
              "وضعيات_الاستلقاء": ["الاستلقاء على الظهر", "الاستلقاء على البطن", "الاستلقاء على الجنب"],
              "وضعيات_غير_مألوفة": ["الانبطاح", "الانتصاب العادي على اربعة", "الانتصاب المعكوس على اربعة", "الوقوف على رجل واحدة", "الوقوف على ركبتين"],
              "التنقل_العادي": ["مشي عادي فردي", "مشي عادي ثنائي", "مشي نشيط فردي", "مشي نشيط ثنائي", "هرولة فردية", "هرولة ثنائية"]
            }
          },
          {
            "Field_Title": "الحركات القاعدية",
            "Final_Competency": "ينفذ حركات قاعدية مبنية على تكامل وظائف جسمه",
            "Knowledge_resources": {
              "شكل_التنقل": ["المشي الفردي", "المشي الثنائي", "الجري الفردي", "الجري الثنائي", "المشي الجانبي", "المشي خلفا"],
              "وتيرة_التنقل": ["المشي البطيء", "المشي المتوسط", "المشي السريع", "الجري البطيء", "الجري المتوسط", "الجري السريع"]
            }
          }
        ]
      },
      "السنة_الثانية": {
        "Overall_efficiency": "ينفذ حركات طبيعية بسيطة في وضعيات وتنقلات متنوعة، ويعدلها حسب الموقف، محدداً الأسلوب المناسب للفضاء المتاح.",
        "Learning_Field": [
          {
            "Field_Title": "الوضعيّات والتنقلات",
            "Final_Competency": "يعدّل في الوقت المناسب وضعياته وتنقلاته من موقف إلى آخر.",
            "Knowledge_resources": {
              "الوضعية_المناسبة": ["الوقوف", "الانحناء", "الجثو", "المشي", "الجري", "الوثب"],
              "التنقل_المناسب": ["عمل الأطراف", "التسارع", "خفض السرعة"]
            }
          }
        ]
      },
      "السنة_الثالثة": {
        "Overall_efficiency": "يبني جملة من التصرفات القاعدية المتعلقة بالجري والرمي وينفذها حسب الموقف.",
        "Learning_Field": [
          {
            "Field_Title": "الحركات القاعدية",
            "Final_Competency": "ينجز حركات قاعدية متعلقة بالجري وبالرمي.",
            "Knowledge_resources": {
              "الجري": ["الجري على خط مستقيم", "الجري في منعرج"],
              "الرمي": ["الرمي لعدة اتجاهات", "الرمي لأبعد مسافة"]
            }
          }
        ]
      },
      "السنة_الرابعة": {
        "Overall_efficiency": "ينجز فردياً وجماعياً حركات قاعدية تتعلق بالوثب والرمي مبنية على وضعيات، محافظاً على ترابطها بما يتماشى وفضاء الممارسة.",
        "Learning_Field": [
          {
            "Field_Title": "الحركات القاعدية",
            "Final_Competency": "يؤدي حركات قاعدية متعلقة بالوثب والرمي ويحافظ على تنسيق مراحلها وفق فضاء الممارسة المتاح",
            "Knowledge_resources": {
              "أنماط_الوثب_و_أنواعه": ["وثب برجل واحدة", "وثب بالرجلين"],
              "الرمي_حسب_الموقف": ["الرمي بيد واحدة", "الرمي باليدين"]
            }
          }
        ]
      },
      "السنة_الخامسة": {
        "Overall_efficiency": "ينجز عمليات فردياً وجماعياً مبنية على حركات قاعدية، ويحافظ على ترابطها، ويلائم وضعية جسمه بما يتوافق والوضعية المطروحة، ويمارس بعض الرياضات الجماعية.",
        "Learning_Field": [
          {
            "Field_Title": "الهيكلة والبناء",
            "Final_Competency": "يمارس بعض الرياضات الجماعية وفق مبادئ اللعبة والتقنيات الأساسية.",
            "Knowledge_resources": {
              "الألعاب_الجماعية": ["كرة اليد للصغار", "كرة السلة للصغار"],
              "الحركات_التقنية_الأساسية": ["تمريرات الكرة و مسكها", "المراوغة والتنقل بالكرة"]
            }
          }
        ]
      }
    }
  }
};